import pandas as pd
import streamlit as st
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression


from streamlit_extras.let_it_rain import rain
rain(
    emoji="🏮",
    font_size=30,
    falling_speed=10,
    animation_length="infinite",
)

st.markdown(
    f"""
       <style>
       .stApp {{
           background-image: url("https://i.pinimg.com/originals/94/a2/04/94a2049612564eb3590db8444df09eeb.gif");
           background-attachment: fixed;
           background-size: cover;
           /* opacity: 0.3; */
       }}
           [data-testid="stSidebar"]{{
           background-image: url(https://i.pinimg.com/564x/b2/26/89/b226893037004fbb754909648fc6b64b.jpg);
           background-size: cover;
        }}
       </style>
       """,
    unsafe_allow_html=True
)

tab1,tap2,tap3 = st.tabs(['Home','แนวซีรี่ส์','ประเมินข้อมูล'])
with tab1:

    st.title('OMG Series')
    st.markdown('## ซีรี่ส์เด่นซีรี่ส์ดัง')
    st.sidebar.markdown('')





with tap2:

    original_list = ['','ซีรี่ส์จีนแนวย้อนยุค', 'ซีรี่ส์จีนแนวโรงเรียน', 'ซีรี่ส์จีนแนวสืบสวน']
    And = st.selectbox('ค้นหา🔍', original_list)

with tap3:
    pow = st.selectbox('Choose type series',
                       ['ซีรี่ส์จีนแนวย้อนยุค', 'ซีรี่ส์จีนแนวโรงเรียน', 'ซีรี่ส์จีนแนวสืบสวน'])
    if pow == 'ซีรี่ส์จีนแนวย้อนยุค':
        volume = st.columns(2)
        Series = volume[0].number_input('Type of game', min_value=1)
        colum = st.columns(3)
        load = colum[0].button('โหลดข้อมูลนิยาย')
        if load:
            st.write('กำลังโหลดข้อมูล...')
            df = pd.read_excel('OOP/S1.xlsx')
            st.write('"Success"')
            st.dataframe(df)
            fig, ax = plt.subplots()
            df.plot.scatter(x='เดือน', y='ยอดขายนิยาย', ax=ax)
            st.pyplot(fig)
        train = colum[1].button('ฝึกประเมินยอดขายเเต่ละปี')
        if train:
            st.write('กำลังฝึกประเมิน')
            df = pd.read_excel('OOP/S1.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            st.write('"Success"')
        predict = colum[2].button('ประเมินผู้ขาย')
        if predict:
            df = pd.read_excel('OOP/S1.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            target = model.predict([[Series]])[0]
            st.markdown(f"ยอดขายในปี {Series} จำนวนยอดขายนิยายประมาณ{target:.2f}เล่ม")

    if pow == 'ซีรี่ส์จีนแนวโรงเรียน':
        volume = st.columns(2)
        book = volume[0].number_input('Type of game', min_value=1)
        colum = st.columns(3)
        load = colum[0].button('โหลดข้อมูลนิยาย')
        if load:
            st.write('กำลังโหลดข้อมูล...')
            df = pd.read_excel('OOP/S2.xlsx')
            st.write('"Success"')
            st.dataframe(df)
            fig, ax = plt.subplots()
            df.plot.scatter(x='เดือน', y='ยอดขายนิยาย', ax=ax)
            st.pyplot(fig)
        train = colum[1].button('ฝึกประเมินยอดขายเเต่ละปี')
        if train:
            st.write('กำลังฝึกประเมิน')
            df = pd.read_excel('OOP/S2.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            st.write('"Success"')
        predict = colum[2].button('ประเมินผู้ขาย')
        if predict:
            df = pd.read_excel('OOP/S2.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            target = model.predict([[Series]])[0]
            st.markdown(f"ยอดขายในปี {Series} จำนวนยอดขายนิยายประมาณ{target:.2f}เล่ม")
    if pow ==  'ซีรี่ส์จีนแนวสืบสวน':
        volume = st.columns(2)
        book = volume[0].number_input('Type of game', min_value=1)
        colum = st.columns(3)
        load = colum[0].button('โหลดข้อมูลนิยาย')
        if load:
            st.write('กำลังโหลดข้อมูล...')
            df = pd.read_excel('OOP/S3.xlsx')
            st.write('"Success"')
            st.dataframe(df)
            fig, ax = plt.subplots()
            df.plot.scatter(x='เดือน', y='ยอดขายนิยาย', ax=ax)
            st.pyplot(fig)
        train = colum[1].button('ฝึกประเมินยอดขายเเต่ละปี')
        if train:
            st.write('กำลังฝึกประเมิน')
            df = pd.read_excel('OOP/S3.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            st.write('"Success"')
        predict = colum[2].button('ประเมินผู้ขาย')
        if predict:
            df = pd.read_excel('OOP/S3.xlsx')
            model = LinearRegression()
            model.fit(df[['เดือน']], df['ยอดขายนิยาย'])
            target = model.predict([[Series]])[0]
            st.markdown(f"ยอดขายในปี {Series} จำนวนยอดขายนิยายประมาณ{target:.2f}เล่ม")

if And == 'ซีรี่ส์จีนแนวย้อนยุค':
    st.title('แนะนำซีรี่ส์แนวย้อนยุคจีน')
    st.markdown('เมื่อพูดถึง “ซีรีส์จีน” หลายคนอาจจะนึกถึงซีรีส์ย้อนยุคกำลังภายในสุดแสนอลังการที่เสื้อผ้าจะต้องจัดเต็มและต้องมีเครื่องประดับครบชุด ใช่ค่ะทุกคนนี่เป็นเอกลักษณ์ของ'
               '“ซีรีส์จีนแนวย้อนยุค” ซีรีส์จีนย้อนยุคส่วนใหญ่มักจะเป็นซีรีส์ที่อิงประวัติศาสตร์เพื่อช่วยให้คุณสามารถศึกษาประวัติศาสตร์จีนได้อย่างเต็มที่และทำให้เราสามารถเพลิดเพลินกับเรื่องราวในประวัติศาสตร์ได้'
               'เมื่อดูซีรีส์ย้อนยุคจะทำให้คุณเพลิดเพลินกับฉากและภาพที่สวยงาม นอกจากนี้เสื้อผ้าและเครื่องแต่งกายก็มีความซับซ้อนและเลิศหรูอลังการมากด้วยเนื้อเรื่องของซีรีส์จีนย้อนยุคจะให้ความรู้สึกเข้มข้น '
               'ตัวละครทุกตัวในซีรีส์มักจะมีปัญหาชีวิตและจะนำเสนอเรื่องราวการแสวงหาอำนาจ นอกจากนี้ยังนำเสนอวิถีทางสังคมที่ถึงแม้ว่าโลกจะไม่ยุติธรรมแต่ผู้คนก็ยังคงรักกัน'
               'ซีรีส์จีนแนวย้อนยุคกับซีรีส์ย้อนยุคของเกาหลีนั้นไม่ได้มีความแตกต่างกันมากนัก เพียงแต่ว่าซีรีส์จีนนั้นจะมีความอลังการกว่า เรื่องราวดราม่ามีความเข้มข้น เน้นนำเสนอการใช้วรยุทธ์และกำลังภายในมากกว่าซีรีส์เกาหลี' 
               ' อีกทั้งยังมีจำนวนตอนที่มากกว่าด้วยทำให้เราฟินกันไปยาว ๆหากวันนี้คุณกำลังมองหาซีรีส์จีนย้อนยุคสักเรื่องไว้ดู เรามีมาแนะนำค่ะ ')
    st.markdown('### 🌸1.สามชาติสามภพ ป่าท้อสิบหลี่🌸')
    st.markdown('![imge](https://i.pinimg.com/originals/bf/a6/08/bfa608ad02212524ecfcca21e5f58001.gif)')
    st.markdown('🌐: https://youtu.be/8ecAVReyD1E')
    st.markdown('เริ่มกันที่เรื่องแรกที่ยอดวิวสูงมากกก อย่าง สามชาติสามภพ ป่าท้อสิบหลี่ (Ten Miles Of Peach Blossoms/Eternal Love) เป็นเรื่องที่รวบรวมนักแสดงชื่อดังเยอะสุด'
                ' ไม่ว่าจะเป็น หยางมี่, จ้าวโย่วถิง, ตี่ลี่เร่อปา, เกาเว่ยกวง, จางปินปิน และคนอื่นๆ บอกเลยว่าดีงาม! ส่วนเนื้อเรื่องเกี่ยวกับ ป๋ายเฉี่ยน (หยางมี่)'
                'ปลอมตัวมาเป็นชายชื่อซืออินเพื่อไปฝึกวิชาที่ภูเขาคุนหลุนซวี เธอจึงได้เป็นศิษย์เทพแห่งสงครามอย่าง ม่อยวน (จ้าวโย่วถิง) ต่อมาเผ่าวิหคคิดเป็นปฏิปักษ์กับเผ่าเทพ'
                'เทพสวรรค์จึงมีบัญชาให้ม่อยวนไปปราบ ซึ่งเหตุการณ์นี้ทำให้ดวงจิตของม่อยวนก็ต้องแตกดับ เรื่องราวจะเป็นอย่างไรต่อสามารถไปชมกันได้เลย สนุกครบรสเลยไม่ว่าจะเป็นแนวแฟนตาซี '
                'โรแมนติก ดราม่า อาจจะมีความความสลับซับซ้อนของตัวละครอยู่หน่อย แต่ถ้าติดตามดูทุกตอนก็จะเข้าใจเลยน้า นอกจากนี้ยังมีภาคต่ออย่าง สามชาติสามภพลิขิตเหนือเขนย ด้วย')
    st.markdown('### 🌸2.ลำนำรักเคียงบัลลังก์🌸')
    st.markdown('![imge](https://i.pinimg.com/564x/d0/f6/11/d0f611c8e8eb8a1fb4fd1fc18ed3fb71.jpg)')
    st.markdown('🌐: https://youtu.be/QFpO6eYL5AM')
    st.markdown('เป็นอีกเรื่องที่พระนางดีงามและมากความสามารถอย่าง เฉิงอี้ และ จางอวี่ซี โดยเรื่องนี้เป็นแนวชิงบัลลังก์ อำนาจ สะท้อนให้เห็นถึงเรื่องราวของฮ่องเต้ที่ต้องขึ้นครองราชย์ภายใต้อำนาจการควบคุมของขันทีชั่ว '
                'จักรพรรดิเหวินจงแห่งราชวงศ์ถังและครอบครัวของนางเอกซึ่งเป็นอัครมหาเสนาบดีจึงคิดแผนการขึ้นมา แต่แผนการกลับล้มเหลวจนถูกประหาร ซึ่งสองพี่น้องรอดมาได้ คนเป็นน้องสาวเปลี่ยนชื่อใหม่ว่า อวี๋ปิงเอ๋อร์ ( จางอวี่ซี )'
                ' เป็นบุตรบุญธรรมของสำนักจื่ออี ส่วนคนเป็นพี่สาวเปลี่ยนชื่อใหม่ว่า ฉิวเยียนจือ เป็นบุตรบุญธรรมของสำนักของฉิวซื่อเหลียง แต่กลับเกิดเป็นศึกสายเลือดเพราะเมื่อโตมาต่างคนก็ต่างจำกันไม่ได้ ต่อมา หลี่เหยียน ( เฉิงอี้ )'
                ' ได้ขึ้นครองบัลลังก์ต่อจากพี่ชายและมีความคิดที่อยากจะล้มล้างขันทีชั่วของของสำนักฉิวเยียนจือ เรื่องราวบอกเลยว่าเข้มข้นแน่นอน')
    st.markdown('### 🌸3.สตรีหาญ ฉางเกอ🌸')
    st.markdown('![imge](https://i.pinimg.com/564x/41/f6/ed/41f6ed1641046ecca1b0ee6b2d07ed4f.jpg)')
    st.markdown('🌐:https://youtu.be/FApHREO-rs8')
    st.markdown(' สตรีหาญ ฉางเกอ ( The Long Ballad ) เรื่องนี้ดัดแปลงมาจากมังงะเรื่อง ‘ฉางเกอฉิง’ (Chang Ge Xing)  เรื่องเกี่ยวกับ องค์หญิงหลี่ฉางเกอ (ตี๋ลี่เร่อปา) บุตรีของรัชทายาทองค์ก่อนเธอรอดชีวิตจากการสังหารหมู่ทั้งตระกูล'
                ' เพื่อเอาชีวิตรอดและกลับมาล้างแค้น เธอจึงปลอมเป็นชายและเปลี่ยนชื่อ ระหว่างทางบังเอิญได้ความช่วยเหลือจาก อาซือเล่อสุ่น หรือ สุ่นเท่อฉิน (อู๋เหล่ย) บุตรชายบุญธรรมจากเผ่าทุ่งหญ้า'
                ' แต่โชคชะตากลับจับพลัดจับผลูให้ทั้งสองมาเป็นศัตรูกัน เรื่องนี้เนื้อเรื่องดีน่าติดตามดูทุกตอน ฉางเกอคือหญิงที่สวย เก่ง กล้าหาญ เริ่ด!')
    st.markdown('### 🌸4.Sassy Beauty บล็อกเกอร์สาวทะลุมิติ🌸')
    st.markdown('![imge](https://www.seriesk.co/wp-content/themes/kserieshd/scripts/timthumb.php?src=https://www.seriesk.co/wp-content/uploads/2022/01/03.jpeg&w=728&h=485&zc=1)')
    st.markdown('🌐: https://youtu.be/VSn3UmvXx6I')
    st.markdown('เรื่องราวของ "ซือเหยียน" บล็อกเกอร์แต่งหน้าสาวคนหนึ่ง ที่ประสบอุบัติเหตุจนต้องนอนหลับไม่ได้สติอยู่นาน 1 ปีเต็ม จนกระทั่งพ่อแม่ของเธอจึงตัดสินใจใช้เทคโนโลยีเสมือนจริงเพื่อกระตุ้นคลื่นสมองเพื่อลูกสาวให้ฟื้นจากนิทรา แต่เธอกลับทะลุมิติเข้าไปยังอดีต และต้องเตรียมตัวไปสอบเป็น '
                '"นางกำนัลประทินโฉม" ในจวนตงหลี จนเกิดเรื่องวุ่นๆ ขึ้นมากมาย เรียกได้ว่าเป็นหนังซีรีส์จีนย้อนยุคแนวแฟนตาซี ที่สอดแทรกความคอมเมดี้ไว้ให้ผู้ชมได้ยิ้มและหัวเราะตลอดทั้งเรื่อง สามารถรับชมได้แล้วทางสตรีมมิง iQIYI ')
    st.markdown('### 🌸5.Who Rules The World 🌸')
    st.markdown('![imge](https://i.pinimg.com/564x/65/9d/bd/659dbdb8579129b502132d3806a51d51.jpg)')
    st.markdown('🌐: https://youtu.be/P_3uZJ2mhf4')
    st.markdown('ซีรี่ย์จีนย้อนยุค 2022 เรื่องถัดมามีชื่อไทยว่า “เทียบเท้าปฐพี” พูดถึงการแย่งยิงอำนาจเพื่อต้องการความเป็นใหญ่บนแผ่นดินต้าตงซึ่งเกิดจากการรวมแคว้น 6 ดินแดนเข้าด้วยกัน ซึ่งกษัตริย์ผู้ครองคือ “ฮ่องเต้ฉุนสี่”'
                ' และผู้ปกครองย่อยของแคว้นอื่นถูกเรียกว่า “อ๋อง” ด้วยความโลภมากของผู้ปกครองในแต่ละแคว้นจึงเกิดสงครามและแบ่งออกเป็นก๊กต่าง ๆ'
                ' กระทั่งจอมยุทธ์ชายหญิงนามว่า “ไป๋เฟิงซี” และ “เฮยเฟิงซี” ก็ปรากฏตัวเพื่อต้องการนำเอาป้ายขั้วกาฬที่หายไปคืนมาและทำให้แผ่นดินสงบสุขอีกครั้ง')


if And == 'ซีรี่ส์จีนแนวโรงเรียน':
    st.title('ซีรีส์จีนแนวโรงเรียน')
    st.markdown('เมื่อพูดถึงซีรีส์ทุกคนก็คงจะรู้ดีว่าซีรีส์เกาหลีและซีรีส์จีนนั้นได้รับความนิยมมาก ถึงแม้ในช่วงแรกซีรีส์เกาหลีอาจจะครองใจหลาย ๆ คนมาตลอดแต่พักหลัง ๆ'
                ' ซีรีส์จีนก็เริ่มที่จะตีคู่มาติด ๆ นั่นเป็นเพราะความมีเอกลักษณ์ของซีรีส์จีนและการเข้าถึงบทบาททำให้ซีรีส์จีนครองใจใครหลาย ๆ คน เมื่อนึกถึงซีรีส์จีนหลายคนอาจจะนึกถึงซีรีส์ย้อนยุคกำลังภายใน '
                'เพราะซีรีส์อิงประวัติศาสตร์หรือซีรีส์กำลังภายในนี้ถือเป็นเอกลักษณ์เฉพาะของประเทศจีนเลยก็ได้ หากคุณเป็นคอซีรีส์จีนแต่ไม่เคยดูซีรีส์กำลังภายในแปลว่าคุณได้สร้างความผิดพลาดครั้งยิ่งใหญ่ให้กับตัวเองแล้ว '
                'ซีรีส์จีนกำลังภายในผ่านการสร้างสรรค์มาอย่างดี มีความอลังการอีกทั้งยังมีเรื่องราวและพล็อตเรื่องที่แปลกใหม่ครองใจผู้ชม '
                'แต่แน่นอนค่ะว่านอกจากซีรีส์กำลังภายในแล้วก็ยังมีซีรีส์อีกหนึ่งประเภทที่ได้รับความนิยมไม่แพ้กัน นั่นก็คือ “ซีรีส์จีนแนวไฮสคูล” ซีรีส์แนวไฮสคูลของจีนถ่ายทอดความเป็นโรงเรียนและบรรยากาศในชั้นเรียนเป็นอย่างดีง')
    st.markdown('### 💕1.Go Ahead ถักทอรักที่ปลายฝัน💕')
    st.markdown('![imge](https://i.pinimg.com/564x/9f/20/b3/9f20b3e308b12b82c16f82862c83bf45.jpg)')
    st.markdown('🌐: https://youtu.be/JWkX6S4u7Xo')
    st.markdown('ถักทอรักที่ปลายฝัน (Go Ahead) บอกเล่าเรื่องราวของครอบครัวหนึ่งที่เป็นครอบครัวกันด้วยความบังเอิญ หลี่เจียนเจียน (ถานซงอวิ้น)'
                ' อาศัยอยู่กับหลี่ไห่เฉา ผู้เป็นพ่อที่เปิดกิจการร้านบะหมี่เป็นของตัวเองเพราะแม่ของเธอเสียชีวิตไปนานแล้ว จนวันหนึ่งครอบครัวหลิงก็ย้ายไปอยู่ในละแวกเดียวกับหลี่เจียนเจียนทำให้เธอได้เจอกับหลิงเซียว'
                ' (ซ่งเว่ยหลง) ลูกชายของตระกูลหลิน หลิงเหอผิงและเฉินถิงทะเลาะกันตลอดเวลา พ่อของหลี่เจียนเจียนสงสารหลิงเซียวมากจึงได้ให้ที่พักพิงและอาหารกับเขาเสมอ'
                ' มิตรภาพระหว่างหลี่เจียนเจียนและหลิงเซียวจึงเริ่มก่อตัวขึ้น ต่อมาหลี่ไห่เฉาได้เจอกับเฮ่อเหม่ย เฮ่อเหม่ยมีลูกชายคนหนึ่งชื่อเฮ่อจื่อชิว (จางซินเฉิง) ซึ่งมีอายุรุ่นราวคราวเดียวกับหลิงเซียว'
                ' ตอนแรกเฮ่อเหม่ยก็สนใจในตัวหลี่ไห่เฉาและต้องการแต่งงานด้วย แต่มีเหตุการณ์บางอย่างทำให้เธอได้ออกเดินทางไปที่อื่นและทิ้งเฮ่อจื่อชิวไว้หลี่ไฮ่เฉาเลยสงสารและตัดสินใจที่จะเลี้ยงเฮ่อจื่อชิวเป็นลูกอีกคน'
                ' และแน่นอนว่าหลิงเหอผิงและเฉินถิงทะเลาะกันบ่อยมากจนถึงคราวแตกหักและต้องหย่ากันไป หลิงเซียวเลยต้องอยู่ในการดูแลของพ่อ ทำให้เด็ก 3 คนอย่าง หลิงเซียว หลี่เจียนเจียน และเฮ่อจื่อชิว '
                'ได้กลายมาเป็นครอบครัวเดียวกัน ขอบอกเลยว่าซีรีส์เรื่องนี้เป็นซีรีส์ที่ Feel good มากต้องไม่พลาด เพราะเราจะเห็นพวกเขาในวัยประถม มัธยม มหาวิทยาลัยและการทำงาน')
    st.markdown('### 💕2.Sweet First Love รักใกล้ตัวหัวใจใกล้กัน💕')
    st.markdown('![imge](https://www.wetv-vip.net/wp-content/uploads/2020/10/Sweet-First-Love-%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B9%83%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%95%E0%B8%B1%E0%B8%A7-%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%88%E0%B9%83%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%81%E0%B8%B1%E0%B8%99-%E0%B8%8B%E0%B8%B1%E0%B8%9A%E0%B9%84%E0%B8%97%E0%B8%A2.jpg)')
    st.markdown('🌐: https://youtu.be/Ed1pyt29DEI')
    st.markdown('Sweet First Love บอกเล่าเรื่องราวของจั๋วอีเฟิง (สวี่หย่าถิง) ตอนเธออายุได้ 7 ขวบ เธอได้เห็นการตายของพ่อแม่ของเธอในอุบัติเหตุทางรถยนต์ '
                'แต่ความตกใจของเหตุการณ์ทำให้ความทรงจำนี้ของเธอหายไป เธอเลยต้องย้ายมาอยู่กับซูจื่อเจี้ยนซึ่งเป็นเพื่อนสนิทของพ่อแม่ ซูจื่อเจี้ยนมีลูกชายหนึ่งคนที่ชื่อว่าซูมู่อวิ๋น (เริ่นซื่อหาว)'
                ' ทำให้ซูมู่อวิ๋นและจั๋วอีเฟิงต้องอยู่บ้านเดียวกัน เมื่อพวกเขาเติบโตขึ้นซูมู่อวิ๋นเป็นหนุ่มป๊อปมากในโรงเรียนทั้งหล่อทั้งเรียนเก่ง แต่จั๋วอีเฟิงเป็นคนที่ไม่เอาไหนเพราะเรื่องราวในวัยเด็กทำให้เธอสูญเสียพัฒนาการไป '
                'หากดูเผิน ๆ จะเห็นว่าซูมู่อวิ๋นรังแกจั๋วอีเฟิงตลอดเวลาแต่ในความเป็นจริงเขาคอยปกป้องเธออย่างเงียบ ๆ เพื่อช่วยให้เธอบรรลุความฝัน แต่วันหนึ่งทั้งสองเกิดความเข้าใจผิดกัน จ'
                'ั๋วอีเฟิงจึงออกจากครอบครัวตระกูลซูไปแล้วไปใช้ชีวิตอย่างอิสระ หลังจากนั้นจั๋วอีเฟิงก็สืบหาสาเหตุการตายของพ่อแม่เพื่อให้ได้รู้ว่าใครกันแน่ที่เป็นคนฆ่าพ่อแม่ของเธอ ขอบอกเลยว่าซีรีส์เรื่องนี้ดีมาก '
                'ช่วงแรกคือฟินแต่หลัง ๆ กลิ่นดราม่าเริ่มแรงค่ะ แต่หากคุณชอบแนวพระเอกคลั่งรักต้องดู')
    st.markdown('### 💕3. My Classmate From Far Far Away เพื่อนร่วมชั้นผมเป็นต่างดาว💕')
    st.markdown('![imge](https://seriesfreefun.com/uploads/a02743334151d85dd9e76a9bbbc22fd6.jpg)')
    st.markdown('🌐: https://youtu.be/w9tXn8aL7Ss')
    st.markdown('My Classmate From Far Far Away บอกเล่าเรื่องราวของ ซวนโม่ (หลี่เกิงซี) เธอเป็นเด็กสาวที่ต้องถูกคนอื่นรังแกตลอดเวลาเมื่ออยู่ในโรงเรียน ทำให้เธออยากจะฆ่าตัวตาย'
                ' แต่เรื่องไม่คาดฝันก็เกิดขึ้นเพราะมีนายพลหญิงรุ่นที่ 32 ของ Scorpion Planet ในขณะที่นำกองทัพเข้าสู่สนามรบเธอบังเอิญตกลงสู่พื้นดินบนโลกจนเธอได้เข้ามาอยู่ในร่างของซวนโม่นักเรียนธรรมดา '
                'ซวนโม่กลายมาเป็นคนใหม่เธอเก่งขึ้นกว่าเดิมมากทั้งการเรียนและกีฬาทำฝห้ใครหลายคนอยากเป็นเพื่อนกับเธอ ต่อมาเธอได้รู้จักและตกหลุมรักอี้ไห่หลาน (จูจื้อหลิง) เธอพยายามทำทุกอย่างเพื่อให้ตัวเองได้กลับบ้าน '
                'แต่ในใจนึงเธอก็ไม่อยากจะกลับไปเพราะคนที่เธอรักอยู่ที่นี่ หากคุณชอบซีรีส์ที่นางเอกเก่งและฉลาดมากต้องดูค่ะ')
    st.markdown('### 💕4.FIourish in time เมื่อเธอมีฉัน และฉันมีเธอ💕')
    st.markdown('![imge](https://www.123-hd.com/wp-content/uploads/2021/05/Flourish-in-Time-2021-%E0%B9%80%E0%B8%A1%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B9%80%E0%B8%98%E0%B8%AD%E0%B8%A1%E0%B8%B5%E0%B8%89%E0%B8%B1%E0%B8%99-%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%89%E0%B8%B1%E0%B8%99%E0%B8%A1%E0%B8%B5%E0%B9%80%E0%B8%98%E0%B8%AD.png)')
    st.markdown('🌐: https://youtu.be/kLlAJGjnrXk')
    st.markdown('FIourish in time เมื่อเธอมีฉัน และฉันมีเธอ ซีรีย์แนวโรแมนติก ดราม่า ออนแอร์ในปี 2021 เรื่องราวความรักที่เกิดขึ้นจากความใกล้ชิดของทั้งคู่ พระเอกถูกพ่อของนางเอกรับมาเลี้ยงดู'
                ' เนื่องจากเขานั้นได้ขับรถชนพระเอกจึงรับผิดชอบด้วยการมาเลี้ยงดูในครอบครัวของตัวเอง พระเอกและนางเอกโตมาด้วยกันเรียนหนังสือด้วยกัน คนภายนอกอาจจะมองว่าทั้งคู่นั้นเป็นพี่น้องกัน '
                'แต่ใครจะรู้ว่าลึก ๆ แล้วในใจของพวกเขาคิดอะไรมากกว่านั้น')
    st.markdown('### 💕5.Please Classmate ฝากหน่อยนะคะรุ่นพี่ 💕')
    st.markdown('![imge](https://t1.blockdit.com/photos/2021/09/614c160dd9ab2d2f1c4ac075_800x0xcover_3YNmSxpp.jpg)')
    st.markdown('🌐: https://youtu.be/xunqGyQWMZw')
    st.markdown('Please Classmate ซีรีย์แนวโรแมนติก คอมเมดี้ ออนแอร์ปี 2021 เรื่องราวเกิดขึ้นที่โรงเรียนแห่งหนึ่ง ซึ่งโรงเรียนแห่งนี้ถูกแบ่งออกเป็นสองวิทยาเขต เขตใต้จะเน้นเรื่องกีฬา เขตเหนือจะเน้นเรื่องการเรียน '
                'ทั้งสองวิทยาเขตมักจะมีเรื่องที่ไม่ลงรอยกันอยู่เป็นทุนเดิมอยู่แล้ว แต่แล้ววันหนึ่งทางโรงเรียนจำเป็นต้องยุบทั้งสองวิทยาเขตมารวมกัน '
                'ความวุ่นวายจึงบังเกิดขึ้น หัวหน้าทั้งสองวิทยาเขตจึงต้องทำทุกวิถีทางเพื่อนให้นักเรียนหันมาเข้าใจกันให้ได้')


if And == 'ซีรี่ส์จีนแนวสืบสวน':
    st.title('ซีรีส์จีนแนวสืบสวน')
    st.markdown('### 💎1.Detective L (2019)💎')
    st.markdown('![imge](https://i.pinimg.com/564x/31/50/38/3150382386575c461388dce06c3f3da5.jpg)')
    st.markdown('🌐: https://youtu.be/0bOSESRFHao')
    st.markdown('เซี่ยงไฮ้ยุค 30s บ้านเมืองสงบสุข ยามที่ผู้คนหลับไหลอยู่ในความฝัน ก็ได้เกิดเหตุการณ์ประหลาดขึ้นในเมือง ฉินเสี่ยวม่าน '
                ' หญิงสาวที่เพิ่งจบจากโรงเรียนตำรวจหมาดๆได้หอบเอาความฝันที่อยากจะเป็นสุดยอดนักสืบ เดินทางมาตามหาฝันของตัวเอง และบังเอิญได้มาเป็นเพื่อนบ้านและเพื่อนร่วมงานของ หลัวเฟย '
                'ยอดนักสืบแห่งยุค ในช่วงแรกพวกเขานั้นต้องเป็นคู่กัดกันเพราะด้วยนิสัยที่แตกต่าง แต่กลับต้องมาร่วมมือกันไขคดีประหลาดมากมาย')
    st.markdown('### 💎2.Cold Case (2019)💎')
    st.markdown('![imge](https://m.media-amazon.com/images/M/MV5BMGJkZDRjZjgtNzAxMS00YzAyLWJjMjItOTNkMTVjZjlmOTRkXkEyXkFqcGdeQXVyMTI4MjIyODgz._V1_.jpg)')
    st.markdown('🌐: https://youtu.be/zxmBebACwUw')
    st.markdown('เป็นเรื่องราวของ หลัวอิงเหว่ย ตำรวจหญิง ปราบปรามยาเสพติด ที่ต้องสูญเสียคนรักไปเนื่องจากปฏิบัติหน้าที่ หลังจากนั้นเธอได้ขอย้ายไปอยู่ฝ่ายเอกสาร และได้ร่วมมือกับตำรวจหญิงอีก3คน'
                ' ก่อตั้งทีมCold Caseขึ้นมาเพื่อไขความจริงบางอย่างเกี่ยวกับแก๊งค์ค้ายาเสพติด')
    st.markdown('### 💎 3.Guardian (2018)💎')
    st.markdown('![imge](https://3.bp.blogspot.com/-pdHjxhlH9ck/XBwq7lkcKxI/AAAAAAAACuI/LtqZRUgKGSExHW8BGCyRW-Nuz5T0MgqiQCLcBGAs/s1600/87042b962d6a6afb84c1be054e9e6466fe9be40fr1-800-1169v2_hq.jpg)')
    st.markdown('🌐:https://youtu.be/YkVp3_V7I3I')
    st.markdown('มนุษย์ดาวตี้ซิงได้เดินทางมาบนโลก (ดาวไฮ่ซิง) แต่ด้วยอะไรหลายๆอย่าง ทำให้ยีนในร่างกายของพวกเขาเกิดการเปลี่ยนแปลง ถึงจะมีร่างกายเหมือนมนุษย์ แต่กลับมีพลังพิเศษที่แตกต่างกันไป'
                'พวกเขาอาศัยอยู่ใต้ดินของโลกมนุษย์ หลังเกิดเหตุการณ์อุกกาบาตตกลงมายังพื้นโลก ก็มีบางกลุ่ม อยากยึดครองดินแดนของมนุษย์ที่อุดมสมบูรณ์กว่า จึงได้นำชาวไฮ่ซิงและพวกกลายพันธุ์ทำสงครามกับมนุษย์โลก แต่เพราะของวิเศษทั้ง 4 อย่าง ที่ได้รับพลังวิเศษจากอุกกาบาต'
                ' จึงทำให้ชาวไฮซิงพ่ายแพ้ ยอมทำสนธิสัญญาสันติภาพ ว่าจะอยู่ใต้ดินอย่างสงบและเงียบเชียบ หลายพันปีผ่านไป (หมื่นปี) มนุษย์โลกส่วนใหญ่ได้ลืมเลือนเหตุการณ์ในครั้งนั้นจนสิ้น')
    st.markdown('### 💎4.Visible Lie (2018)💎')
    st.markdown('![imge](https://i0.wp.com/cdramabase.com/wp-content/uploads/2018/11/007q4aholy1fxd535uv3oj30u01607ws.jpg?resize=400%2C560&ssl=1)')
    st.markdown('🌐: https://youtu.be/yME8QK8H1YI')
    st.markdown('เล่าเรื่องราวเกี่ยวกับการเผชิญการแพร่ระบาดของโควิด-19 ในประเทศจีน โดยมีกองทัพแนวหน้าอย่าง เจ้าหน้าที่ แพทย์ พยาบาล นักวิจัย อาสาสมัคร และประชาชนคนทั่วไป '
                'ี่ต่างทุ่มเทให้กับการต่อสู้เพื่อเอาชนะกับโรคดังกล่าว ซึ่งระหว่างทางต้องประสบพบเจอกับปัญหาต่างๆมากมายในช่วงวิกฤตโควิด-19')
    st.markdown('### 💎5.Young Blood Agency (2019)💎')
    st.markdown('![imge](https://i.mydramalist.com/72wZDf.jpg)')
    st.markdown('🌐: https://youtu.be/468rtAPcFm0')
    st.markdown('นักสืบยังบลัด เยาวชนเลือดร้อนสี่คนจัดตั้งหน่วยงานสืบสวนขึ้นเพื่อค้นหาความจริง Young Blood Agency เป็นหน่วยงานสืบสวนในยุคสาธารณรัฐที่อุทิศตนเพื่อแก้คดีลึกลับ'
                'ชื่อเสียงของพวกเขาเพิ่มขึ้นพร้อมกับความลึกลับทุกอย่างที่พวกเขาแก้ แต่กรณีไม่ง่ายอย่างที่พวกเขาดูเหมือนจะเกี่ยวข้องกับความเกลียดชังความไม่สงบจากรุ่นก่อน '
                'สมาชิกทั้งสี่ของทีมรู้ทันทีว่าพวกเขามีความสัมพันธ์ที่ซับซ้อนซึ่งกันและกัน ดูซีรี่ย์จีน Young Blood Agency (2019) นักสืบยังบลัด ซับไทย ได้ที่kserie')

